Revit 2026 API

# PointCloudTypeScale Property

---

The multiplier applied to the points in all instances of this point cloud.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Scale { get; set; }
```
```vb
Public Property Scale As Double
	Get
	Set
```
```cpp
public:
property double Scale {
	double get ();
	void set (double value);
}
```
```fsharp
member Scale : float with get, set
```

#### Property Value

Double

Scale converts the units in which the coordinates of individual points of the point cloud are interpreted.

#### Reference

PointCloudType Class

Autodesk.Revit.DB Namespace